challenge22/test/performance/result_fork_info.txt
Phase started: unnamed (index: 0, duration: 1s) 21:22:31(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 21:22:32(-0300)

--------------------------------------
Metrics for period to: 21:22:40(-0300) (width: 4.793s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 210/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 25
  max: ......................................................................... 297
  median: ...................................................................... 206.5
  p95: ......................................................................... 273.2
  p99: ......................................................................... 290.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3814.5
  max: ......................................................................... 4226.4
  median: ...................................................................... 4065.2
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4231.1


All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 21:22:37(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 210/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 25
  max: ......................................................................... 297
  median: ...................................................................... 206.5
  p95: ......................................................................... 273.2
  p99: ......................................................................... 290.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3814.5
  max: ......................................................................... 4226.4
  median: ...................................................................... 4065.2
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4231.1